Revit 2027 API
AnalyticalLink.IsValidHub Method
 Checks whether input hub is valid for an AnalyticalLink.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidHub(
	Document doc,
	ElementId hubId
)
Public Shared Function IsValidHub (
	doc As Document,
	hubId As ElementId
) As Boolean
public:
static bool IsValidHub(
	Document^ doc,
	ElementId^ hubId
)
static member IsValidHub :
        doc : Document *
        hubId : ElementId -> bool
Parameters
doc Document
 Hubs's document.
hubId ElementId
 Hub to test for validity.
Return Value
Boolean
 True is returned when provided hubId points hub that is valid for AnalyticalLink, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace